In [1]:
import pandas as pd
df = {
    "cars": ['bmw', 'volvo', 'audi'],
    "passings": [2, 3, 5]
}
pd.DataFrame(df)

    cars  passings
0    bmw         2
1  volvo         3
2   audi         5

In [2]:
a = [1, 2, 3]
pd.Series(a)

0    1
1    2
2    3
dtype: int64

In [3]:
a = [1, 5, 7, 8]
pd.Series(a, index=['x', 'y', 'z', 'u'])

x    1
y    5
z    7
u    8
dtype: int64

In [4]:
calories = {"day1": 120, "day2": 230, "day3": 500}
pd.Series(calories, index=['day1', 'day2'])

day1    120
day2    230
dtype: int64

In [5]:
#series is like a column ina table and dataframe is the whole table

In [6]:
df = {
    "cars": ['bmw', 'volvo', 'audi'],
    "passings": [2, 3, 5]
}
pd.DataFrame(df)

    cars  passings
0    bmw         2
1  volvo         3
2   audi         5

In [7]:
df1 = {
    "names": ["pav", "nav", "pra"],
    "age": [25, 27, 26]
}
x = pd.DataFrame(df1)
x

  names  age
0   pav   25
1   nav   27
2   pra   26

In [8]:
x.loc[1]

names    nav
age       27
Name: 1, dtype: object

In [9]:
x.iloc[0, 0:]

names    pav
age       25
Name: 0, dtype: object

In [10]:
ds = pd.read_csv("Downloads\data.csv")

In [11]:
ds.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [12]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [13]:
ds.isna().sum()

Duration    0
Pulse       0
Maxpulse    0
Calories    5
dtype: int64

In [14]:
ds.isna()['Calories'].sum()

5

In [15]:
ds.dropna()

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

In [16]:
ds.dropna(inplace=True)

In [17]:
ds.shape

(164, 4)

In [18]:
ds['Calories'].fillna(130, inplace=True)

In [19]:
ds.shape

(164, 4)

In [20]:
x = ds["Calories"].mean()

In [21]:
x

375.79024390243916

In [22]:
ds["Calories"].fillna(x, inplace=True)

In [23]:
ds["Calories"]

0      409.1
1      479.0
2      340.0
3      282.4
4      406.0
       ...
164    290.8
165    300.0
166    310.2
167    320.4
168    330.4
Name: Calories, Length: 164, dtype: float64

In [24]:
ds.isna()

     Duration  Pulse  Maxpulse  Calories
0       False  False     False     False
1       False  False     False     False
2       False  False     False     False
3       False  False     False     False
4       False  False     False     False
..        ...    ...       ...       ...
164     False  False     False     False
165     False  False     False     False
166     False  False     False     False
167     False  False     False     False
168     False  False     False     False

[164 rows x 4 columns]

In [25]:
ds.isna()["Calories"].sum()

0

In [26]:
ds["Calories"].median()

318.6

In [27]:
ds["Calories"].sum()

61629.600000000006

In [28]:
61629.600000000006/169

364.67218934911244

In [29]:
ds["Calories"].mode()

0    300.0
Name: Calories, dtype: float64

In [30]:
ds['Calories']

0      409.1
1      479.0
2      340.0
3      282.4
4      406.0
       ...
164    290.8
165    300.0
166    310.2
167    320.4
168    330.4
Name: Calories, Length: 164, dtype: float64

In [31]:
data = [[1,1,2], [4,1, 2], [5,6,4], [2,0,3]]
df = pd.DataFrame(data)
df

   0  1  2
0  1  1  2
1  4  1  2
2  5  6  4
3  2  0  3

In [32]:
df.mean()

0    3.00
1    2.00
2    2.75
dtype: float64

In [33]:
df.median()

0    3.0
1    1.0
2    2.5
dtype: float64

In [34]:
df.mode()

   0    1    2
0  1  1.0  2.0
1  2  NaN  NaN
2  4  NaN  NaN
3  5  NaN  NaN

In [35]:
#mean avg value
#median the mid point value
#mode the most common value